OpenQBMM_2.0.0/tutorials/pbeTransportFoam/TaylorDispersion/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariate;

univariateCoeffs
{
    aggregation off;
    
    aggregationKernel
    {
        aggregationKernel turbulentBrownian;
    }
    
    breakup off;
    
    breakupKernel
    {
        breakupKernel LuoSvendsen;
        
        Cb        Cb        [ 0 0 0 0 0 0 0 ] 1.0e-3;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;
    }
    
    daughterDistribution
    {
        daughterDistribution symmetricFragmentation;
    }
    
    diffusionModel
    {
        diffusionModel  molecularDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 1e-2;
    }

    growth on;
    growthModel
    {
        growthModel constant;
        minAbscissa minAbscissa [ 0 1 0 0 0 0 0 ] 1e-10;
        maxAbscissa maxAbscissa [ 0 1 0 0 0 0 0 ] 1e10;
    }

    nucleation off;

    nucleationModel
    {
        nucleationModel none;
    }
}


// ************************************************************************* //
