OpenQBMM_2.0.0/tutorials/pbeTransportFoam/TaylorDispersion/system/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    topWall      
    {
        type            zeroGradient;
    }

    bottomWall      
    {
        type            zeroGradient;
    }

    inlet      
    {
        type            zeroGradient;
    }

    outlet      
    {
	 		type            fixedValue;
         value           uniform 0;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
