OpenQBMM_2.0.0/tutorials/pbeTransportFoam/TaylorDispersion/system/Allclean
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/CleanFunctions

rm -rf 0 > /dev/null 2>&1

cleanCase

# ----------------------------------------------------------------- end-of-file
